s = input()
t = s.count(' ') +1
print('Сколько слов:', t)
